src/toir_cfe/src/Documents/торо_РезервПодВнутреннийЗаказ/торо_РезервПодВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="894f6e94-4a50-47a3-8a52-83cacbacb647">
  <name>торо_РезервПодВнутреннийЗаказ</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/проф_ЗаказыНаПеремещение/проф_ЗаказыНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="51ed9839-f94d-4af6-a544-57ffe417672b">
  <name>проф_ЗаказыНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="8483efcb-bd12-4199-b41b-a539a1bcd4d1">
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="e3b3525f-0545-4111-ac65-eaac0c5abb62">
    <name>ЗаказНаПеремещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cae60078-65d0-4ea0-9220-bdfe3ac6144d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ce63d106-6324-442a-8fa2-923a4213bb22">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f7f84b90-fa15-42d6-b7c3-461dc7c7a18c">
    <name>КодСтроки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="38870122-b444-45e1-94ae-bf45efee7017">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/проф_ТоварыНаСкладах/проф_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f2b5e01-847b-49d9-b668-ee6122445039">
  <name>проф_ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="78a7323c-7389-4599-84d6-fde6c3c3533d">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="9c39d63c-41cb-4486-a9ee-180052b85921">
    <name>КонтролироватьОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8289f7d9-fa0a-45f7-be0c-238495f87a84">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8df19511-0c7e-41a8-90eb-f953e351a534">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bd312888-71b8-45b3-bbf7-970c05bc2727">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="951359e6-820e-4f61-a602-16a239f40091">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="328ce0e5-8d0f-4315-8e53-033acc81fdd0">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0281d76f-6aa0-4fff-ab25-5a81258abfb3">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="41f4f6c1-a9c4-443f-97b5-62a83d5a9725">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="feae67ed-6dc9-49c5-a307-3811be01be0e">
    <name>проф_ЗаказДляЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3130c2d1-275a-4006-8bec-ffc8eadaf912">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aaee8848-18c0-4459-8461-a6f8cde70246">
    <name>торо_СозданПоПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="873a5588-15b7-419a-ac32-2cfcdd64f86d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c7396b0-71b0-4c54-b9bf-4c429c4af1f6">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a9600285-8615-4521-86d8-2bca0bfd8ec8">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a3c3667-121d-46f4-9b5f-3490c0bc2096">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff47e900-26d4-480f-862d-e7a594cde170">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd34090-ac80-44d9-b29a-f37fc28b0c69">
    <name>торо_СтатусУтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0c65fe73-4b60-4819-b7d6-6271b93f49c0">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f24b0b4d-40fc-46e5-9a5c-1c14fd1080ca">
    <name>проф_ТоварыИсточника</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_РезервПодВнутреннийЗаказ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)
	// ++ Профи-ИТ, #229, Карпов Д. Ю., 19.09.2023 
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(проф_ДокументОснование) Тогда
		
		ФОИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();
		ФОИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить(); 
		
		Блокировка = Новый БлокировкаДанных;	
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.проф_ЗаказыНаПеремещение");
		ЭлементБлокировки.ИсточникДанных = Товары;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		Если ФОИспользоватьХарактеристики Тогда 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
		КонецЕсли;
		ЭлементБлокировки.УстановитьЗначение("ЗаказНаПеремещение", проф_ДокументОснование);
		Если ФОИспользоватьСерии Тогда 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");
		КонецЕсли;
		Блокировка.Заблокировать();
	
		Движения.проф_ЗаказыНаПеремещение.Записывать = Истина;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
						|	торо_РезервПодВнутреннийЗаказТовары.Ссылка КАК Ссылка,
						|	торо_РезервПодВнутреннийЗаказТовары.Номенклатура КАК Номенклатура,
						|	торо_РезервПодВнутреннийЗаказТовары.Характеристика КАК Характеристика,
						|	торо_РезервПодВнутреннийЗаказТовары.Серия КАК Серия,
						|	торо_РезервПодВнутреннийЗаказТовары.КодСтроки КАК КодСтроки,
						|	СУММА(торо_РезервПодВнутреннийЗаказТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
						|	торо_РезервПодВнутреннийЗаказ.проф_ДокументОснование КАК проф_ДокументОснование
						|ПОМЕСТИТЬ ВТ_Товары
						|ИЗ
						|	Документ.торо_РезервПодВнутреннийЗаказ.Товары КАК торо_РезервПодВнутреннийЗаказТовары
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_РезервПодВнутреннийЗаказ КАК торо_РезервПодВнутреннийЗаказ
						|		ПО (торо_РезервПодВнутреннийЗаказТовары.Ссылка = торо_РезервПодВнутреннийЗаказ.Ссылка)
						|ГДЕ
						|	торо_РезервПодВнутреннийЗаказТовары.Ссылка = &Ссылка
                        |
						|СГРУППИРОВАТЬ ПО
						|	торо_РезервПодВнутреннийЗаказТовары.Ссылка,
						|	торо_РезервПодВнутреннийЗаказТовары.Номенклатура,
						|	торо_РезервПодВнутреннийЗаказТовары.Характеристика,
						|	торо_РезервПодВнутреннийЗаказТовары.Серия,
						|	торо_РезервПодВнутреннийЗаказТовары.КодСтроки,
						|	торо_РезервПодВнутреннийЗаказ.проф_ДокументОснование
                        |
						|ИНДЕКСИРОВАТЬ ПО
						|	Ссылка,
						|	Номенклатура,
						|	Характеристика,
						|	Серия,
						|	КодСтроки,
						|	проф_ДокументОснование
						|;
                        |
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	проф_ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
						|	проф_ЗаказыНаПеремещениеОстатки.Номенклатура КАК Номенклатура,
						|	проф_ЗаказыНаПеремещениеОстатки.Характеристика КАК Характеристика,
						|	проф_ЗаказыНаПеремещениеОстатки.КодСтроки КАК КодСтроки,
						|	проф_ЗаказыНаПеремещениеОстатки.Серия КАК Серия,
						|	проф_ЗаказыНаПеремещениеОстатки.КОформлениюОстаток КАК КоличествоОстаток
						|ПОМЕСТИТЬ ВТ_ЗаказыНаПеремещениеОстаток
						|ИЗ
						|	РегистрНакопления.проф_ЗаказыНаПеремещение.Остатки(
						|			&Дата,
						|			(ЗаказНаПеремещение, Номенклатура, Характеристика, КодСтроки, Серия) В
						|				(ВЫБРАТЬ
						|					Т.проф_ДокументОснование КАК ЗаказНаПеремещение,
						|					Т.Номенклатура КАК Номенклатура,
						|					Т.Характеристика КАК Характеристика,
						|					Т.КодСтроки КАК КодСтроки,
						|					Т.Серия КАК Серия
						|				ИЗ
						|					ВТ_Товары КАК Т)) КАК проф_ЗаказыНаПеремещениеОстатки

						|ИНДЕКСИРОВАТЬ ПО
						|	ЗаказНаПеремещение,
						|	Номенклатура,
						|	Характеристика,
						|	КодСтроки,
						|	Серия
						|;

						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ВТ_Товары.Ссылка КАК Ссылка,
						|	ВТ_Товары.Номенклатура КАК Номенклатура,
						|	ВТ_Товары.Характеристика КАК Характеристика,
						|	ВТ_Товары.Серия КАК Серия,
						|	ВТ_Товары.КодСтроки КАК КодСтроки,
						|	ВТ_Товары.КоличествоУпаковок КАК Количество,
						|	ВТ_Товары.проф_ДокументОснование КАК проф_ДокументОснование,
						|	Ном.Представление КАК ПредставлениеНоменклатуры,
						//++ Проф-ИТ, #229, Горетовская М.С., 22.09.2023 - Автом. создания в ТОиР док.
						// "Резервирование на внутренние заказы" на основании док. "Перемещение", созданного в ERP						
						|	ЕстьNull(ВТ_ЗаказыНаПеремещениеОстаток.КоличествоОстаток,0) КАК КоличествоОстаток
						//-- Проф-ИТ, #229, Горетовская М.С., 22.09.2023 - Автом. создания в ТОиР док.
						// "Резервирование на внутренние заказы" на основании док. "Перемещение", созданного в ERP
						|ИЗ
						|	ВТ_Товары КАК ВТ_Товары
						|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыНаПеремещениеОстаток КАК ВТ_ЗаказыНаПеремещениеОстаток
						|		ПО (ВТ_ЗаказыНаПеремещениеОстаток.ЗаказНаПеремещение = ВТ_Товары.проф_ДокументОснование)
						|			И (ВТ_ЗаказыНаПеремещениеОстаток.Номенклатура = ВТ_Товары.Номенклатура)
						|			И (ВТ_Товары.Характеристика = ВТ_ЗаказыНаПеремещениеОстаток.Характеристика)
						|			И (ВТ_Товары.Серия = ВТ_ЗаказыНаПеремещениеОстаток.Серия)
						|			И (ВТ_ЗаказыНаПеремещениеОстаток.КодСтроки = ВТ_Товары.КодСтроки)
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
						|		ПО (ВТ_Товары.Номенклатура = Ном.Ссылка)";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Исключая));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Разница = Выборка.КоличествоОстаток - Выборка.Количество;
			Если Разница < 0 Тогда
				ТекстСообщения = СтрШаблон(
					НСтр("ru = ' По заказам на перемещение обнаружен отрицательный остаток по номенклатуре <%1>.'"),
					Выборка.ПредставлениеНоменклатуры);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			КонецЕсли; 
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли; 
			
			Движение = Движения.проф_ЗаказыНаПеремещение.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗаказНаПеремещение = Выборка.проф_ДокументОснование;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Характеристика = Выборка.Характеристика;
			Движение.КодСтроки = Выборка.КодСтроки;
			Движение.Серия = Выборка.Серия;  
			Движение.КОформлению = Выборка.Количество;
	
		КонецЦикла;
	КонецЕсли;
	// -- Профи-ИТ, #229, Карпов Д. Ю., 19.09.2023
	
	//++ Проф-ИТ, #294, Соловьев А.А., 24.10.2023
	Движения.проф_ТоварыНаСкладах.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_РезервПодВнутреннийЗаказ.Ссылка КАК Регистратор,
	|	торо_РезервПодВнутреннийЗаказ.Дата КАК Период,
	|	торо_РезервПодВнутреннийЗаказТовары.Номенклатура КАК Номенклатура,
	|	торо_РезервПодВнутреннийЗаказТовары.Характеристика КАК Характеристика,
	|	ДокументЗаказНаВнутреннееПотребление.Склад КАК Склад,
	|	торо_РезервПодВнутреннийЗаказТовары.Серия КАК Серия,
	|	торо_РезервПодВнутреннийЗаказТовары.проф_НазначениеИсходное КАК НазначениеИсходное,
	|	торо_РезервПодВнутреннийЗаказТовары.проф_Назначение КАК Назначение,
	|	торо_РезервПодВнутреннийЗаказТовары.Количество КАК ВНаличии
	|ИЗ
	|	Документ.торо_РезервПодВнутреннийЗаказ КАК торо_РезервПодВнутреннийЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_РезервПодВнутреннийЗаказ.Товары КАК торо_РезервПодВнутреннийЗаказТовары
	|		ПО торо_РезервПодВнутреннийЗаказ.Ссылка = торо_РезервПодВнутреннийЗаказТовары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ДокументЗаказНаВнутреннееПотребление
	|		ПО торо_РезервПодВнутреннийЗаказ.ЗаказНаВнутреннееПотребление = ДокументЗаказНаВнутреннееПотребление.Ссылка
	|ГДЕ
	|	торо_РезервПодВнутреннийЗаказ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Назначение) 
			И Не ЗначениеЗаполнено(Выборка.НазначениеИсходное) Тогда 
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.проф_ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Назначение = Выборка.НазначениеИсходное;
		Если ОтменаРезерва Тогда 
			Движение.ВНаличии = Макс(Выборка.ВНаличии, -Выборка.ВНаличии);
		КонецЕсли;
		
		Движение = Движения.проф_ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Если ОтменаРезерва Тогда 
			Движение.ВНаличии = Макс(Выборка.ВНаличии, -Выборка.ВНаличии);
		КонецЕсли;
		
	КонецЦикла;
	//-- Проф-ИТ, #294, Соловьев А.А., 24.10.2023
КонецПроцедуры

&После("ПередЗаписью")
Процедура проф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		проф_ОбщегоНазначенияВызовСервера.ПроверитьПризнакПодразделенияОрганизации(ЭтотОбъект["Подразделение"], Отказ);
	КонецЕсли;
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
